Revit 2027 API
VirtualPrinterType Enumeration
An enumerated to list Virtual Printer Types in Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum VirtualPrinterType
Public Enumeration VirtualPrinterType
public enum class VirtualPrinterType
type VirtualPrinterType
Members
Member name | Value | Description
AdobePDF | 1 |  AdobePDF.
DWFWriter | 2 |  DWFWriter.
None | 0 |  None.
XPSWriter | 3 |  Microsoft XPS Document Writer.
See Also
Reference
Autodesk.Revit.DB Namespace